app/controllers/api/task_controller.rb

  def user_tasks
    puts "==== inside the user_tasks method ======"
    puts "==== params: #{params}"
    render json: { tasks: current_user.tasks.where(list_type: params[:list_type]) }
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = ? AND "tasks"."list_type" = ?  [["user_id", 6], ["list_type", "shared"]]